def primes(a, b):
    """Повернути список простих чисел на відрізку від 'a' до 'b'."""
    res = []

    for i in range(a, b + 1):
        if i < 2:
            continue

        c = 0
        for j in range(1, i + 1):#Перевірка дільників має починатись з 1, а не з 0
            if i % j == 0:#Непотрібно +1, бо цикл вже має починатись з 1
                c += 1

        if c == 2:#Перевірка простоти повинна бути після циклу, а не всерединіІнакше число додається багато разів
            res.append(i)

    return res
print(primes(1, 10))  # [2, 3, 5, 7]